*** src/main.rs:1: replace main with ()

*** mutation diff:
--- src/main.rs
+++ replace main with ()
@@ -1,10 +1,10 @@
 fn main() {
-    println!("Hello, world!");
+() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod main_runs {
 
     use crate::main;
 
     #[test]

---- prints_hello_world stdout ----
thread 'prints_hello_world' panicked at 'assertion failed: `(left == right)`
  left: `""`,
 right: `"Hello, world!\n"`', tests/prints-hello-world.rs:14:5

failures:
    prints_hello_world

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure
